tutorials/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/pyrolysisRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default        none;
}

laplacianSchemes
{
    default         none;
    laplacian(thermo:alpha,h) Gauss linear uncorrected;
    laplacian(kappa,T) Gauss harmonic uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default        uncorrected;
}


// ************************************************************************* //
